BAS BMEKZU Project/src/Catalogs/НоменклатураГТД/НоменклатураГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураГТД</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.БиологическиеАктивы</owners>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/НоменклатураГТД/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьНаименование(НоменклатураГТД) Экспорт
	
	Возврат СокрЛП(НоменклатураГТД.КодУКТВЭД) + ?(ЗначениеЗаполнено(НоменклатураГТД.НомерГТД), ", ВМД №: " + СокрЛП(НоменклатураГТД.НомерГТД.Код) + " від " + Формат(НоменклатураГТД.НомерГТД.Дата, "ДФ=dd.MM.yy"), "");
	
КонецФункции

Функция ПоискИИсправлениеНекорректныхНаименований(МассивСсылок = Неопределено) Экспорт
	    
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьВесьСправочник = (МассивСсылок = Неопределено);
	
	Если Не ОбновитьВесьСправочник И (МассивСсылок.Количество() = 0) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураГТД.Ссылка
	|ИЗ
	|	Справочник.НоменклатураГТД КАК НоменклатураГТД
	|ГДЕ
	|	(&ОбновитьВесьСправочник
	|			ИЛИ НоменклатураГТД.Ссылка В (&МассивСсылок))";
	Запрос.УстановитьПараметр("ОбновитьВесьСправочник", ОбновитьВесьСправочник);
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	КоличествоОбновленныхЭлементов = 0;
	Выборка = Запрос.Выполнить().Выбрать();				   
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.Наименование = ПолучитьНаименование(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		// Не используем ОбменДанными.Загрузка для того чтобы данные
		// корректно мигрировали в подчиненные узлы
		СправочникОбъект.ДополнительныеСвойства.Вставить("ТолькоОбновлениеНаименования");
		СправочникОбъект.Записать();
		
		КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов + 1;
		
	КонецЦикла;
	
	Возврат КоличествоОбновленныхЭлементов;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураГТД КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И (&ПоВсемВладельцам
	|			ИЛИ ДанныеСправочника.Владелец = &Владелец)
	|	И (&СЛюбымНаименованием
	|			ИЛИ ДанныеСправочника.Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""\"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСправочника.НомерГТД.Дата УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	СЛюбымНаименованием = Истина;
	СтрокаПоиска = "";
	Если Параметры.СтрокаПоиска <> Неопределено Тогда
		СЛюбымНаименованием = Ложь;
		СтрокаПоиска = Параметры.СтрокаПоиска;		
	КонецЕсли;
	Запрос.УстановитьПараметр("СЛюбымНаименованием", СЛюбымНаименованием);	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%"+СтрЗаменить(СтрокаПоиска,"\","\\")+"%");	// Ищем по любой части наименования
	
	ПоВсемВладельцам = Истина;
	Владелец = Неопределено;
	Если Параметры.Свойство("Номенклатура", Владелец) Тогда
		ПоВсемВладельцам = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПоВсемВладельцам", ПоВсемВладельцам);	
	Запрос.УстановитьПараметр("Владелец", Владелец);	
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры
